Show / Hide Table of Contents
Enum WeldType
enum of weld types
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum WeldType
Fields
 Name |  Description
 Bevel
Bevel
 Contact
Contact
 DoubleFillet
DoubleFillet
 Fillet
Fillet
 FilletRear
FilletRear
 Intermittent
Intermittent
 LengthAtHaunch
LengthAtHaunch
 NotSpecified
NotSpecified
 Plug
Plug
 Square
Square
 Improve this Doc
 View Source